# Importando Dados e Traduzindo Dados

## Importando Base de Dados

In [117]:
import pandas as pd

dados = pd.read_csv('tips.csv')
dados.head()

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4

## Traduzindo Colunas e Campos

In [118]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [119]:
renomear = {
    'total_bill': 'valor_da_conta', 
    'tip': 'gorjeta',
    'dessert': 'sobremesa',
    'day': 'dia_da_semana',
    'time': 'refeicao',
    'size': 'total_de_pessoas'
}

In [120]:
type(dados)

pandas.core.frame.DataFrame

In [121]:
gorjetas = dados.rename(columns=renomear)
gorjetas.head()

   valor_da_conta  gorjeta sobremesa dia_da_semana refeicao  total_de_pessoas
0           16.99     1.01        No           Sun   Dinner                 2
1           10.34     1.66        No           Sun   Dinner                 3
2           21.01     3.50        No           Sun   Dinner                 3
3           23.68     3.31        No           Sun   Dinner                 2
4           24.59     3.61        No           Sun   Dinner                 4

In [122]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [123]:
sim_nao = {
    'No' : 'Não',
    'Yes': 'Sim'
}

In [124]:
gorjetas.sobremesa.map(sim_nao)

0      Não
1      Não
2      Não
3      Não
4      Não
      ...
239    Não
240    Sim
241    Sim
242    Não
243    Não
Name: sobremesa, Length: 244, dtype: object

In [125]:
gorjetas.head(1)

   valor_da_conta  gorjeta sobremesa dia_da_semana refeicao  total_de_pessoas
0           16.99     1.01        No           Sun   Dinner                 2

In [126]:
gorjetas.sobremesa = gorjetas.sobremesa.map(sim_nao)

In [127]:
gorjetas.head(1)

   valor_da_conta  gorjeta sobremesa dia_da_semana refeicao  total_de_pessoas
0           16.99     1.01       Não           Sun   Dinner                 2

In [128]:
gorjetas.dia_da_semana.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [129]:
dias = {
        'Sun': 'Domingo',
        'Sat': 'Sabado',
        'Thur': 'Quinta',
        'Fri': 'Sexta'
}

In [130]:
gorjetas.dia_da_semana = gorjetas.dia_da_semana.map(dias)

In [131]:
gorjetas.head(1)

   valor_da_conta  gorjeta sobremesa dia_da_semana refeicao  total_de_pessoas
0           16.99     1.01       Não       Domingo   Dinner                 2

In [132]:
gorjetas.dia_da_semana.unique()

array(['Domingo', 'Sabado', 'Quinta', 'Sexta'], dtype=object)

In [133]:
gorjetas.refeicao.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [134]:
refeicao = {
    'Dinner': 'Jantar',
    'Lunch': 'Almoço'
}

In [135]:
gorjetas.refeicao = gorjetas.refeicao.map(refeicao)

In [137]:
gorjetas.head(5)

   valor_da_conta  gorjeta sobremesa dia_da_semana refeicao  total_de_pessoas
0           16.99     1.01       Não       Domingo   Jantar                 2
1           10.34     1.66       Não       Domingo   Jantar                 3
2           21.01     3.50       Não       Domingo   Jantar                 3
3           23.68     3.31       Não       Domingo   Jantar                 2
4           24.59     3.61       Não       Domingo   Jantar                 4